src/cf/Documents/КонструкторМаршрутов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>КонструкторМаршрутов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ТочкиМаршрутов</xr:Item>
				<xr:Item>InformationRegister.ПланированиеМаршрутов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Планирование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.вогНаселенныеПункты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.вогНаселенныеПункты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТРТ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.вогТорговыеТочки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоТРТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Авиа</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аренда</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЖД</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛичныйТранспорт</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автобус</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СлужебныйТранспорт</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Такси</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проживание</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторРодителя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уровень</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Километраж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторМаршрута</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РРО_РТН</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГД</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прочие</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/ПланированиеМаршрутов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>ПланированиеМаршрутов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Авиа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аренда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛичныйТранспорт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автобус</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СлужебныйТранспорт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Такси</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проживание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Километраж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РРО_РТН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПериодПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыКомандировок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодМаршрута</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ТочкиМаршрутов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>ТочкиМаршрутов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПериодПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыКомандировок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Точка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодМаршрута</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/МаршрутыКомандировок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>МаршрутыКомандировок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставМаршрута</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаселенныйПункт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.вогНаселенныеПункты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Точка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.вогТорговыеТочки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Documents/КонструкторМаршрутов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаТаблицыПланированиеМаршрутов(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицыТочкиМаршрутов(Запрос, ТекстыЗапроса, Регистры);
	
	ПроведениеСервер.ИнициализироватьТаблицыДляДвижений(
		Запрос,
		ТекстыЗапроса,
		ДополнительныеСвойства.ТаблицыДляДвижений,
		Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
КонецПроцедуры

Функция ТекстЗапросаТаблицыПланированиеМаршрутов(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ПланированиеМаршрутов";
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонструкторМаршрутовПланирование.Ссылка КАК Ссылка,
	|	КонструкторМаршрутовПланирование.Ссылка.Дата КАК Дата,
	|	КонструкторМаршрутовПланирование.ТРТ КАК ТРТ,
	|	КонструкторМаршрутовПланирование.Период КАК Период,
	|	КонструкторМаршрутовПланирование.Ссылка.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	КонструкторМаршрутовПланирование.КоличествоДней КАК КоличествоДней,
	|	КонструкторМаршрутовПланирование.Авиа КАК Авиа,
	|	КонструкторМаршрутовПланирование.Аренда КАК Аренда,
	|	КонструкторМаршрутовПланирование.ЖД КАК ЖД,
	|	КонструкторМаршрутовПланирование.ЛичныйТранспорт КАК ЛичныйТранспорт,
	|	КонструкторМаршрутовПланирование.Автобус КАК Автобус,
	|	КонструкторМаршрутовПланирование.СлужебныйТранспорт КАК СлужебныйТранспорт,
	|	КонструкторМаршрутовПланирование.Такси КАК Такси,
	|	КонструкторМаршрутовПланирование.Проживание КАК Проживание,
	|	КонструкторМаршрутовПланирование.Километраж КАК Километраж,
	|	КонструкторМаршрутовПланирование.Идентификатор КАК Идентификатор,
	|	КонструкторМаршрутовПланирование.ИдентификаторРодителя КАК ИдентификаторРодителя,
	|	КонструкторМаршрутовПланирование.Уровень КАК Уровень,
	|	КонструкторМаршрутовПланирование.ИдентификаторМаршрута КАК ИдентификаторМаршрута,
	// +++ VOG Кулаков П.Л. 18.06.2021 DEV-665
	|	КонструкторМаршрутовПланирование.Клиент КАК Клиент,
	// --- VOG Кулаков П.Л.
	// ++ VOG Солодов В.В. 16.06.2021 DEV-655
	|	КонструкторМаршрутовПланирование.Ссылка.Подразделение КАК Подразделение,
	|	КонструкторМаршрутовПланирование.Ссылка.Ответственный КАК Ответственный,
	|	КонструкторМаршрутовПланирование.РРО_РТН КАК РРО_РТН,
	|	КонструкторМаршрутовПланирование.ГД КАК ГД,
	|	КонструкторМаршрутовПланирование.Прочие КАК Прочие,
	|	КонструкторМаршрутовПланирование.Ссылка.ПериодПланирования КАК ПериодПланирования
	// -- VOG Солодов В.В. 16.06.2021 DEV-655
	|ПОМЕСТИТЬ ВТ_ВсеСтроки
	|ИЗ
	|	Документ.КонструкторМаршрутов.Планирование КАК КонструкторМаршрутовПланирование
	|ГДЕ
	|	КонструкторМаршрутовПланирование.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СтрокиМаршрут.Ссылка КАК Регистратор,
	|	СтрокиМаршрут.Дата КАК Период,
	// ++ VOG Солодов В.В. 16.06.2021 DEV-655
	|	СтрокиМаршрут.ПериодПланирования КАК ПериодПланирования,
	|	СтрокиМаршрут.Период КАК ПериодМаршрута,
	// До изменения
	//|	СтрокиМаршрут.Период КАК ПериодПланирования,
	// -- VOG Солодов В.В. 16.06.2021 DEV-655
	|	МаршрутыКомандировок.Ссылка КАК Маршрут,
	|	СтрокиМаршрут.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СтрокиМаршрут.КоличествоДней КАК КоличествоДней,
	|	СтрокиМаршрут.Авиа КАК Авиа,
	|	СтрокиМаршрут.Аренда КАК Аренда,
	|	СтрокиМаршрут.ЖД КАК ЖД,
	|	СтрокиМаршрут.ЛичныйТранспорт КАК ЛичныйТранспорт,
	|	СтрокиМаршрут.Автобус КАК Автобус,
	|	СтрокиМаршрут.СлужебныйТранспорт КАК СлужебныйТранспорт,
	|	СтрокиМаршрут.Такси КАК Такси,
	|	СтрокиМаршрут.Проживание КАК Проживание,
	|	СтрокиМаршрут.Километраж КАК Километраж,
	|	СтрокиМаршрут.Идентификатор КАК Идентификатор,
	// ++ VOG Солодов В.В. 16.06.2021 DEV-655
	|	СтрокиМаршрут.Подразделение КАК Подразделение,
	|	СтрокиМаршрут.Ответственный КАК Ответственный,
	|	СтрокиМаршрут.РРО_РТН КАК РРО_РТН,
	|	СтрокиМаршрут.ГД КАК ГД,
	|	СтрокиМаршрут.Прочие КАК Прочие
	// -- VOG Солодов В.В. 16.06.2021 DEV-655
	|ИЗ
	|	ВТ_ВсеСтроки КАК СтрокиМаршрут
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МаршрутыКомандировок КАК МаршрутыКомандировок
	|		ПО СтрокиМаршрут.ИдентификаторМаршрута = МаршрутыКомандировок.Идентификатор
	|			И (НЕ МаршрутыКомандировок.ПометкаУдаления)
	|ГДЕ
	|	СтрокиМаршрут.Уровень = 0";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицыТочкиМаршрутов(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ТочкиМаршрутов";
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СтрокиМаршрут.Ссылка КАК Регистратор,
	|	СтрокиМаршрут.Дата КАК Период,
	// ++ VOG Солодов В.В. 16.06.2021 DEV-655
	|	СтрокиМаршрут.ПериодПланирования КАК ПериодПланирования,
	|	СтрокиМаршрут.Период КАК ПериодМаршрута,
	// До изменения
	//|	СтрокиМаршрут.Период КАК ПериодПланирования,
	|	МаршрутыКомандировок.Ссылка КАК Маршрут,
	|	ВТ_ВсеСтроки.ТРТ КАК Точка,
	// +++ VOG Кулаков П.Л. 18.06.2021 DEV-665
	|	ВТ_ВсеСтроки.Клиент КАК Клиент,
	// --- VOG Кулаков П.Л.
	|	СтрокиМаршрут.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СтрокиМаршрут.Идентификатор КАК Идентификатор
	|ИЗ
	|	ВТ_ВсеСтроки КАК ВТ_ВсеСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеСтроки КАК СтрокиГород
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеСтроки КАК СтрокиРегион
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеСтроки КАК СтрокиМаршрут
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МаршрутыКомандировок КАК МаршрутыКомандировок
	|					ПО СтрокиМаршрут.ИдентификаторМаршрута = МаршрутыКомандировок.Идентификатор
	|						И (НЕ МаршрутыКомандировок.ПометкаУдаления)
	|				ПО СтрокиРегион.ИдентификаторРодителя = СтрокиМаршрут.Идентификатор
	|			ПО СтрокиГород.ИдентификаторРодителя = СтрокиРегион.Идентификатор
	|		ПО ВТ_ВсеСтроки.ИдентификаторРодителя = СтрокиГород.Идентификатор
	|ГДЕ
	|	ВТ_ВсеСтроки.Уровень = 3";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Заполняет движения документа по регистру "ПланированиеМаршрутов"
//
Процедура ОтразитьДанныеПланированияМаршрутов(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПланированиеМаршрутов;
	
	Если Отказ Или Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.ПланированиеМаршрутов.Записывать = Истина;
	Движения.ПланированиеМаршрутов.Загрузить(Таблица);

КонецПроцедуры

// Заполняет движения документа по регистру "ТочкиМаршрутов"
//
Процедура ОтразитьДанныеТочкиМаршрутов(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаТочкиМаршрутов;
	
	Если Отказ Или Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.ТочкиМаршрутов.Записывать = Истина;
	Движения.ТочкиМаршрутов.Загрузить(Таблица);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
